/**
 * @file    Gear.cpp
 * @brief   变速算法
 *
 * @author  Tang-yucheng (QQ: 3143961287)
 * @date    2024-2-15
 * @version v1.0
 */

/* 头文件引用 ----------------------------------------------------------------------------------------------------------*/
#include "Gear.h"

/************************************************************************************************************************
 * @brief   斜坡变速控制器初始化
 *
 * @param   __Step_Length   变速步长
 ***********************************************************************************************************************/
void Class_Gear_Slope::Init(float __Step_Length)
{
    if (__Step_Length > 0.0f)
    {
        this->Step_Length = __Step_Length;
    }
}

/************************************************************************************************************************
 * @brief   斜坡变速控制器变速计算一次
 ***********************************************************************************************************************/
void Class_Gear_Slope::Calculate()
{
    /* 判断是否需要计算 */
    if (Math_Abs(this->Set_Val - this->Out_Val) <= this->Step_Length)
    {
        /* 无需计算，直接赋值 */
        this->Out_Val = this->Set_Val;
    }
    else
    {
        /* 需要变速 */
        if (this->Out_Val < this->Set_Val)
        {
            this->Out_Val += this->Step_Length;
        }
        else
        {
            this->Out_Val -= this->Step_Length;
        }
    }
}
